src/main/resources/atscale-micro/0040-req.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><Session xmlns="urn:schemas-microsoft-com:xml-analysis" SessionId="2EF2676D-4D63-455D-A136-93C08062CB01"/></soap:Header><soap:Body><Execute xmlns="urn:schemas-microsoft-com:xml-analysis"><Command><Statement>WITH MEMBER [Measures].[XL_SD0] AS 'strtomember("[Measures].[Sales Amount]").UniqueName' MEMBER [Measures].[XL_SD1] AS 'strtomember("[Measures].[Sales Amount]").properties("caption")' MEMBER [Measures].[XL_SD2] AS '{strtomember("[Measures].[Sales Amount]")}.item(0).item(0).level.UniqueName' MEMBER [Measures].[XL_SD3] AS 'strtomember("[Measures].[Tax Amt]").UniqueName' MEMBER [Measures].[XL_SD4] AS 'strtomember("[Measures].[Tax Amt]").properties("caption")' MEMBER [Measures].[XL_SD5] AS '{strtomember("[Measures].[Tax Amt]")}.item(0).item(0).level.UniqueName' SELECT {[Measures].[XL_SD0],[Measures].[XL_SD1],[Measures].[XL_SD2],[Measures].[XL_SD3],[Measures].[XL_SD4],[Measures].[XL_SD5]} ON 0 FROM [AS Adventure Micro] CELL PROPERTIES VALUE</Statement></Command><Properties><PropertyList><Catalog>ASAdventureMicro</Catalog><Timeout>0</Timeout><Format>Native</Format><DbpropMsmdFlattened2>false</DbpropMsmdFlattened2><SafetyOptions>2</SafetyOptions><Dialect>MDX</Dialect><MdxMissingMemberMode>Error</MdxMissingMemberMode><DbpropMsmdOptimizeResponse>9</DbpropMsmdOptimizeResponse><DbpropMsmdActivityID>BF00EFBA-6825-45D4-AD5D-F26EB2C668E6</DbpropMsmdActivityID><DbpropMsmdRequestID>E536AA77-BAE4-4136-AE6C-D0191838BAD2</DbpropMsmdRequestID><LocaleIdentifier>1033</LocaleIdentifier><DbpropMsmdMDXCompatibility>1</DbpropMsmdMDXCompatibility></PropertyList></Properties></Execute></soap:Body></soap:Envelope>